Ran Plan for dir: `spanner-instance` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.cloud_spanner["test-instance"].google_spanner_instance.instance_processing_units[0] will be created
+ resource "google_spanner_instance" "instance_processing_units" {
      + config           = "regional-us-central1"
      + display_name     = "Spanner demo"
      + effective_labels = {
          + "env" = "demo"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "env" = "demo"
        }
      + name             = "test-instance"
      + num_nodes        = (known after apply)
      + processing_units = 100
      + project          = "onkar-17-cloud"
      + state            = (known after apply)
      + terraform_labels = {
          + "env" = "demo"
        }
    }

  # module.cloud_spanner["test-instance"].google_spanner_instance_iam_member.instance["user:onkar.naik@forescout.com=>roles/spanner.databaseAdmin"] will be created
+ resource "google_spanner_instance_iam_member" "instance" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + instance = "test-instance"
      + member   = "user:onkar.naik@forescout.com"
      + project  = "onkar-17-cloud"
      + role     = "roles/spanner.databaseAdmin"
    }

  # module.cloud_spanner["test-instance-2"].google_spanner_instance.instance_processing_units[0] will be created
+ resource "google_spanner_instance" "instance_processing_units" {
      + config           = "regional-us-east4"
      + display_name     = "Spanner Prod"
      + effective_labels = {
          + "env" = "prod"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "env" = "prod"
        }
      + name             = "test-instance-2"
      + num_nodes        = (known after apply)
      + processing_units = 200
      + project          = "onkar-17-cloud"
      + state            = (known after apply)
      + terraform_labels = {
          + "env" = "prod"
        }
    }

  # module.cloud_spanner["test-instance-2"].google_spanner_instance_iam_member.instance["user:onkar.naik@forescout.com=>roles/spanner.databaseAdmin"] will be created
+ resource "google_spanner_instance_iam_member" "instance" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + instance = "test-instance-2"
      + member   = "user:onkar.naik@forescout.com"
      + project  = "onkar-17-cloud"
      + role     = "roles/spanner.databaseAdmin"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ spanner_instance_details = {
      + test-instance   = {
          + spanner_instance_iam_details = {
              + "user:onkar.naik@forescout.com=>roles/spanner.databaseAdmin" = {
                  + condition = []
                  + etag      = (known after apply)
                  + id        = (known after apply)
                  + instance  = "test-instance"
                  + member    = "user:onkar.naik@forescout.com"
                  + project   = "onkar-17-cloud"
                  + role      = "roles/spanner.databaseAdmin"
                }
            }
          + spanner_instance_id          = (known after apply)
        }
      + test-instance-2 = {
          + spanner_instance_iam_details = {
              + "user:onkar.naik@forescout.com=>roles/spanner.databaseAdmin" = {
                  + condition = []
                  + etag      = (known after apply)
                  + id        = (known after apply)
                  + instance  = "test-instance-2"
                  + member    = "user:onkar.naik@forescout.com"
                  + project   = "onkar-17-cloud"
                  + role      = "roles/spanner.databaseAdmin"
                }
            }
          + spanner_instance_id          = (known after apply)
        }
    }
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d spanner-instance
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=Onkar179%252Fterraform-sample-repo%252Fspanner-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d spanner-instance
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```